stub/soap-hello.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:tns="http://example.org/">
  <soap:Body>
    <tns:HelloSend>
      <firstName>Dan</firstName>
      <lastName>Moren</lastName>
    </tns:HelloSend>
  </soap:Body>
</soap:Envelope>